package lesson9;

public class Examples {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//Спроектировать приложение, содержащее фиксированный пул потоков (на три потока). 
		// Главный поток приложения выполняет рекурсивный обход заданной директории на диске 
		// (должна быть возможность задания директории при запуске приложения) и для всех 
		// файлов запускает задание подсчета частоты байтов в файле (массив счетчиков 0..255 
		// элементов). По окончанию работы приложения должна быть сформирована сводка частоты 
		// байтов по всем файлам всех поддиректорий.
	}

}
